Java基础知识笔记-9-图形程序设计

# Swing概述
现在，Swing是不对等基于GUI工具箱的正式名字。它已是Java基础类库(Java Foundation Class, JFC) 的一部分。完整的JFC十分庞大，其中包含的内容远远大于Swing GUI 工具箱。
JFC特性不仅仅包含了Swing组件，而且还包含了一个可访问性API、一个2D API和一个可拖放API。

> 注释：Swing没有完全替代AWT,而是基于AWT架构之上。Swing 仅仅提供了能力更加强大的用户界面组件。尤其在采用Swing编写的程序中，还需要使用基本的AWT处
理事件。从现在开始，Swing是指“被绘制的”用户界面类；AWT是指像事件处理这样的窗口工具箱的底层机制。

当然，在用户屏幕上显示基于Swing用户界面的元素要比显示AWT的基于对等体组件的速度慢一些。鉴于以往的经验，对于任何一台现代的计算机来说，微小的速度差别无妨大
碍。另外，由于下列几点无法抗拒的原因，人们选择Swing:
- Swing 拥有一个丰富、便捷的用户界面元素集合。
- Swing 对底层平台依赖的很少，因此与平台相关的bug 很少。
- Swing 给予不同平台的用户一致的感觉。

不过，上面第三点存在着一个潜在的问题：如果在所有平台上用户界面元素看起来都一样，那么它们就有可能与本地控件不一样，而这些平台的用户对此可能并不熟悉。

Swing采用了一种很巧妙的方式来解决这个问题。在程序员编写Swing程序时，可以为程序指定专门的“观感”。

此外，Sun开发了一种称为Metal的独立于平台的观感。现在，市场上人们将它称为“Java 观感”。不过，绝大多数程序员还继续沿用Metal这个术语，在本书中也将这样称呼。
有些人批评Metal有点笨重， 而在Java SE 5.0中看起来却焕然一新（参见图10-3)。现在，Metal外观支持多种主题， 每一种主题的颜色和字体都有微小的变化。默认的主题叫做
Oceano在Java SE 6 中， Sun 改进了对Windows 和GTK 本地观感的支持。Swing 应用程序将会
第W 章? 形程序? ? 4 0 5
支持色彩主题的个性化设置， 逼真地表现着动态按钮和变得十分时尚的滚动条。
